---
title: "Data Science with Pandas (part 3: Combining DataFrames)"
format: html
execute: 
  enabled: true
---

## Combining data frames

In many real life cases, you may find data saved into different files and, therefore, you may need to deal with several different pandas DataFrames. In the previous session, we saw how can we easily run statistical analysis on a single DataFrame, so, ideally, we would like to have all the relevant data for our analysis inside a single DataFrame. <br>
In this session we will explore different ways of combining DataFrames into a single DataFrame.

Let's start loading the pandas library, reading two data sets into pandas DataFrames, and having a quick look at the tabular data: ```surveys.csv``` and ```species.csv```

In [3]:
import pandas as pd

In [3]:
surveys_df = pd.read_csv("../data/surveys.csv", keep_default_na=False, na_values=[""])
species_df = pd.read_csv("../data/species.csv", keep_default_na=False, na_values=[""])

In [4]:
print(surveys_df.info())
print('='*72)
surveys_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35549 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        35549 non-null  int64
 1   month            35549 non-null  int64
 2   day              35549 non-null  int64
 3   year             35549 non-null  int64
 4   plot_id          35549 non-null  int64
 5   species_id       34786 non-null  object
 6   sex              33038 non-null  object
 7   hindfoot_length  31438 non-null  float64
 8   weight           32283 non-null  float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.4+ MB
None
========================================================================

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [5]:
print(species_df.info())
print('='*72)
species_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   species_id  54 non-null     object
 1   genus       54 non-null     object
 2   species     54 non-null     object
 3   taxa        54 non-null     object
dtypes: object(4)
memory usage: 1.8+ KB
None
========================================================================

  species_id             genus          species    taxa
0         AB        Amphispiza        bilineata    Bird
1         AH  Ammospermophilus          harrisi  Rodent
2         AS        Ammodramus       savannarum    Bird
3         BA           Baiomys          taylori  Rodent
4         CB   Campylorhynchus  brunneicapillus    Bird

### Concatenating DataFrames

The first way we will combine DataFrames is **concatenation**, i.e. simply putting DataFrames one after the other either **verically** or **horizontally**. To concatenate two DataFrames you will use the function ```pd.concat```, specifying as arguments the DataFrames to concatenate and ```axis=0``` or ```axis=1``` for vertical or horizontal concatenation, respectively.

To play a bit with DataFrame concatenation, we will use a subset of the DataFrames we just read. In particular, we will work with two sub-DataFrames obtained selecting the first and the last 10 rows of the ```surveys.csv``` dataset.

In [6]:
# Subsetting data frames
surveys_df_sub_first10 = surveys_df.head(10)
surveys_df_sub_last10  = surveys_df.tail(10)

Let's start with **vertical stacking**. In this case the two DataFrames are simply stacked on top of each other (remember to specify ```axis=0```).
<div>
<img src="pictures/vertical_stacking.jpeg" width="300"/>
</div>

In [7]:
# Stack the DataFrames on top of each other
vertical_stack = pd.concat([surveys_df_sub_first10, surveys_df_sub_last10], axis=0)

In [8]:
print(vertical_stack.info())
print('='*72)
vertical_stack

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 35548
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        20 non-null     int64
 1   month            20 non-null     int64
 2   day              20 non-null     int64
 3   year             20 non-null     int64
 4   plot_id          20 non-null     int64
 5   species_id       19 non-null     object
 6   sex              16 non-null     object
 7   hindfoot_length  15 non-null     float64
 8   weight           6 non-null      float64
dtypes: float64(2), int64(5), object(2)
memory usage: 1.6+ KB
None
========================================================================

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
5,6,7,16,1977,1,PF,M,14.0,NaN
6,7,7,16,1977,2,PE,F,NaN,NaN
7,8,7,16,1977,1,DM,M,37.0,NaN
8,9,7,16,1977,1,DM,F,34.0,NaN
9,10,7,16,1977,6,PF,F,20.0,NaN
35539,35540,12,31,2002,15,PB,F,26.0,23.0
35540,35541,12,31,2002,15,PB,F,24.0,31.0
35541,35542,12,31,2002,15,PB,F,26.0,29.0
35542,35543,12,31,2002,15,PB,F,27.0,34.0
35543,35544,12,31,2002,15,US,NaN,NaN,NaN
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

The resulting DataFrame (```vertical_stack```) consists, as expected, of 20 rows. These are the result of the first and last 10 rows of out original DataFrame ```surveys_df```. You may have noticed that the last ten rows have very high index, not consecutive with the first ten rows. This is because concatenation preserves the indices of the two original DataFrames. If you want a brand new set of indices for your concateneted DataFrame, simply resets the indices using the method ```.reset_index()```.

In [9]:
vertical_stack.reset_index()

,index,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,0,1,7,16,1977,2,NL,M,32.0,NaN
1,1,2,7,16,1977,3,NL,M,33.0,NaN
2,2,3,7,16,1977,2,DM,F,37.0,NaN
3,3,4,7,16,1977,7,DM,M,36.0,NaN
4,4,5,7,16,1977,3,DM,M,35.0,NaN
5,5,6,7,16,1977,1,PF,M,14.0,NaN
6,6,7,7,16,1977,2,PE,F,NaN,NaN
7,7,8,7,16,1977,1,DM,M,37.0,NaN
8,8,9,7,16,1977,1,DM,F,34.0,NaN
9,9,10,7,16,1977,6,PF,F,20.0,NaN
10,35539,35540,12,31,2002,15,PB,F,26.0,23.0
11,35540,35541,12,31,2002,15,PB,F,24.0,31.0
12,35541,35542,12,31,2002,15,PB,F,26.0,29.0
13,35542,35543,12,31,2002,15,PB,F,27.0,34.0
14,35543,35544,12,31,2002,15,US,NaN,NaN,NaN
15,35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
16,35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
17,35546,35547,12,31,2002,10,RM,F,15.0,14.0
18,35547,35548,12,31,2002,7,DO,M,36.0,51.0
19,35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

<div class="alert alert-block alert-success">
<b>TRY IT YOURSELF</b>: In the given example of vertical concatenation, you concatenated two DataFrames with the same columns. What would happen if the two DataFrames to concatenate have different column number and names?
    <ol>
        <li>Create a new DataFrame using the last 10 rows of the species DataFrame;</li>
        <li>Concatenate vertically ```surveys_df_sub_first_10``` and your just created DataFrame;</li>
        <li>Print the concatenated DataFrame info on the screen. How may rows does it have? What happened to the columns? Can you tell, finally, what happens when you vertically concatenate two DataFrames with different columns?
    </ol>
</div>

It's now time to try **horizontal concatenation**. In this case the two DataFrames are simply stacked one after  one other (remember to specify ```axis=1```).
<div>
<img src="pictures/horizontal_stacking.jpeg" width="300"/>
</div>
In this case, as a result, we expect a DataFrame with the same number of rows of the original one (10 row) and twice the number of columns (18 columns).

In [10]:
# Place the DataFrames side by side
horizontal_stack = pd.concat([surveys_df_sub_first10, surveys_df_sub_last10], axis=1)

In [11]:
print(horizontal_stack.info())
print('='*72)
horizontal_stack

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 35548
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        10 non-null     float64
 1   month            10 non-null     float64
 2   day              10 non-null     float64
 3   year             10 non-null     float64
 4   plot_id          10 non-null     float64
 5   species_id       10 non-null     object
 6   sex              10 non-null     object
 7   hindfoot_length  9 non-null      float64
 8   weight           0 non-null      float64
 9   record_id        10 non-null     float64
 10  month            10 non-null     float64
 11  day              10 non-null     float64
 12  year             10 non-null     float64
 13  plot_id          10 non-null     float64
 14  species_id       9 non-null      object
 15  sex              6 non-null      object
 16  hindfoot_length  6 non-null      float64
 17  weight           6 non-null      float64
dtypes: float64(14), object(4)
memory usage: 3.0+ KB
None
========================================================================

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1.0,7.0,16.0,1977.0,2.0,NL,M,32.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,7.0,16.0,1977.0,3.0,NL,M,33.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,7.0,16.0,1977.0,2.0,DM,F,37.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,7.0,16.0,1977.0,7.0,DM,M,36.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,7.0,16.0,1977.0,3.0,DM,M,35.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,6.0,7.0,16.0,1977.0,1.0,PF,M,14.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,7.0,7.0,16.0,1977.0,2.0,PE,F,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,8.0,7.0,16.0,1977.0,1.0,DM,M,37.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,9.0,7.0,16.0,1977.0,1.0,DM,F,34.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,10.0,7.0,16.0,1977.0,6.0,PF,F,20.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35539,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35540.0,12.0,31.0,2002.0,15.0,PB,F,26.0,23.0
35540,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35541.0,12.0,31.0,2002.0,15.0,PB,F,24.0,31.0
35541,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35542.0,12.0,31.0,2002.0,15.0,PB,F,26.0,29.0
35542,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35543.0,12.0,31.0,2002.0,15.0,PB,F,27.0,34.0
35543,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35544.0,12.0,31.0,2002.0,15.0,US,NaN,NaN,NaN
35544,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35545.0,12.0,31.0,2002.0,15.0,AH,NaN,NaN,NaN
35545,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35546.0,12.0,31.0,2002.0,15.0,AH,NaN,NaN,NaN
35546,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35547.0,12.0,31.0,2002.0,10.0,RM,F,15.0,14.0
35547,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35548.0,12.0,31.0,2002.0,7.0,DO,M,36.0,51.0
35548,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35549.0,12.0,31.0,2002.0,5.0,NaN,NaN,NaN,NaN

Looking at the result of our horizontal concatenation, we may realise that something went wrong. The total number of row on the resulting DataFrame is 20, that is not what we would expect from a horizontal stacking (we where expecting 10 rows, as the initial DataFrames). This happens because horizontal stacking is based on index and our two DataFrames have different indices (1-9 and 35539-35548 respectively). In order to properly stack the DataFrame we need first to reset the indeces of the second DataFrame so that they will match the ones of the first DataFrame.

In [12]:
surveys_df_sub_last10 = surveys_df_sub_last10.reset_index(drop=True)

In [13]:
surveys_df_sub_last10

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,35540,12,31,2002,15,PB,F,26.0,23.0
1,35541,12,31,2002,15,PB,F,24.0,31.0
2,35542,12,31,2002,15,PB,F,26.0,29.0
3,35543,12,31,2002,15,PB,F,27.0,34.0
4,35544,12,31,2002,15,US,NaN,NaN,NaN
5,35545,12,31,2002,15,AH,NaN,NaN,NaN
6,35546,12,31,2002,15,AH,NaN,NaN,NaN
7,35547,12,31,2002,10,RM,F,15.0,14.0
8,35548,12,31,2002,7,DO,M,36.0,51.0
9,35549,12,31,2002,5,NaN,NaN,NaN,NaN

Now that the index has been reset, we can concatenate this DataFrame with the first 10 lines DataFrame.

In [14]:
horizontal_stack = pd.concat([surveys_df_sub_first10, surveys_df_sub_last10], axis=1)

In [15]:
print(horizontal_stack.info())
print('='*72)
horizontal_stack

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   record_id        10 non-null     int64
 1   month            10 non-null     int64
 2   day              10 non-null     int64
 3   year             10 non-null     int64
 4   plot_id          10 non-null     int64
 5   species_id       10 non-null     object
 6   sex              10 non-null     object
 7   hindfoot_length  9 non-null      float64
 8   weight           0 non-null      float64
 9   record_id        10 non-null     int64
 10  month            10 non-null     int64
 11  day              10 non-null     int64
 12  year             10 non-null     int64
 13  plot_id          10 non-null     int64
 14  species_id       9 non-null      object
 15  sex              6 non-null      object
 16  hindfoot_length  6 non-null      float64
 17  weight           6 non-null      float64
dtypes: float64(4), int64(10), object(4)
memory usage: 1.5+ KB
None
========================================================================

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN,35540,12,31,2002,15,PB,F,26.0,23.0
1,2,7,16,1977,3,NL,M,33.0,NaN,35541,12,31,2002,15,PB,F,24.0,31.0
2,3,7,16,1977,2,DM,F,37.0,NaN,35542,12,31,2002,15,PB,F,26.0,29.0
3,4,7,16,1977,7,DM,M,36.0,NaN,35543,12,31,2002,15,PB,F,27.0,34.0
4,5,7,16,1977,3,DM,M,35.0,NaN,35544,12,31,2002,15,US,NaN,NaN,NaN
5,6,7,16,1977,1,PF,M,14.0,NaN,35545,12,31,2002,15,AH,NaN,NaN,NaN
6,7,7,16,1977,2,PE,F,NaN,NaN,35546,12,31,2002,15,AH,NaN,NaN,NaN
7,8,7,16,1977,1,DM,M,37.0,NaN,35547,12,31,2002,10,RM,F,15.0,14.0
8,9,7,16,1977,1,DM,F,34.0,NaN,35548,12,31,2002,7,DO,M,36.0,51.0
9,10,7,16,1977,6,PF,F,20.0,NaN,35549,12,31,2002,5,NaN,NaN,NaN,NaN

<div class="alert alert-block alert-success">
<b>TRY IT YOURSELF</b>: In the given example of horizontal concatenation, you first concatenated two DataFrame with different indices, then reset the indices of the second one. Base on the outcome of these two cases, try to answer the following questions:
    <ol>
        <li>What happens when you concatenate horizontally two DataFrames with different indexing?</li>
        <li>What happens when you concatenate horizontally two DataFrames with the same columns?</li>
        <li>What happens when you try to select a column of the just horizontally concatenated DataFrame?></li>
        <li>How can you select a specific columns among duplicates?</li>
    </ol>
</div>

### Joining DataFrames

Concatenating DataFrames seems a quite "brutal" operation, you simply merge them one after another either verically or horizontally. What about if you want to merge DataFrames according to the value contained in specific columns? The pandas function ```merge()``` performs an operation that in database language is called *join*, the join operation adds the content of one DataFrame to another. There are different types of joins, but the workflow to perform a join operation is always the same:
<ol>
    <li> You identify a *left* and a *right* DataFrames, the ones you want to join;</li>
    <li> You identify in both your left and righ DataFrame a column to join on;</li>
    <li> You choose the type of join;</li>
    <li> You perform the join running the function <code>pd.merge()</code> with the specified inputs and options.</li>
</ol>

Let's see some join example considering two tiny (few rows) DataFrames, our left DataFrame contains general data of European capitals, while our right DataFrame contains weather measuraments for some Dutch towns.

In [12]:
left_df = pd.read_csv("../data/EU_capitals_tiny.csv", sep=",", header=0)
right_df = pd.read_csv("../data/Netherlands_town_weather_tiny.csv", sep=",", header=0)

In [13]:
left_df

     Capital         Country  Population Time_zone  Elevation
0  Amsterdam  The Netherland     2480394     UTC+1         -2
1       Rome           Italy     1459402     UTC+1         21
2      Paris          France    10858852     UTC+1        131
3     Madrid           Spain     6791667     UTC+1        650
4     Berlin         Germany     4473101     UTC+1         34
5     Lisbon        Portugal     2719000     UTC+1          2

In [14]:
right_df

        Town  Elevation  Temperature  Humidity Wind dir  Wind strengh
0  Amsterdam          2           12        81       SW            21
1     Arnhem         13           12        82        S             6
2    Utrecht          5           13        78        S            18
3  Rotterdam          0           13        84       SW            13
4     Leiden          0           12        89       SW            19
5   Den Haag          1           12        85       SW            19
6  Rotterdam          0           13        84       SW            16

The column we want to perform the join on is the one containing information about the town. In the left DataFrame this has name *Capital* while in the right one *Town*.

In [17]:
inner_join = pd.merge(left_df,right_df,left_on='Capital',right_on='Town',how='inner')
inner_join

,Capital,Country,Population,Time_zone,Elevation_x,Town,Elevation_y,Temperature,Humidity,Wind dir,Wind strengh
0,Amsterdam,The Netherland,2480394,UTC+1,-2,Amsterdam,2,12,81,SW,21

As you may notice, the resulting DataFrame has only one line, the only row that the columns *Capital* and *Town* have in common (*Amsterdam*). This is because an inner join selects only those row values that are **the same** in the two columns (mathematically, an intersection).<br>
The columns of the two DataFrames are merged, even if they have the same name. In our case, both left and right DataFrames have a column with the same name (*Elevation*). After merging, the two columns are preserved, but with a suffix to distinguish them. If you are not happy with the default suffix, you may specify yours in the list of arguments of the ```pd.merge``` functions.<br>

Let's now look at the other joins:

In [18]:
left_join = pd.merge(left_df,right_df,left_on='Capital',right_on='Town',how='left')
left_join

,Capital,Country,Population,Time_zone,Elevation_x,Town,Elevation_y,Temperature,Humidity,Wind dir,Wind strengh
0,Amsterdam,The Netherland,2480394,UTC+1,-2,Amsterdam,2.0,12.0,81.0,SW,21.0
1,Rome,Italy,1459402,UTC+1,21,NaN,NaN,NaN,NaN,NaN,NaN
2,Paris,France,10858852,UTC+1,131,NaN,NaN,NaN,NaN,NaN,NaN
3,Madrid,Spain,6791667,UTC+1,650,NaN,NaN,NaN,NaN,NaN,NaN
4,Berlin,Germany,4473101,UTC+1,34,NaN,NaN,NaN,NaN,NaN,NaN
5,Lisbon,Portugal,2719000,UTC+1,2,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
right_join = pd.merge(left_df,right_df,left_on='Capital',right_on='Town',how='right')
right_join

,Capital,Country,Population,Time_zone,Elevation_x,Town,Elevation_y,Temperature,Humidity,Wind dir,Wind strengh
0,Amsterdam,The Netherland,2480394.0,UTC+1,-2.0,Amsterdam,2,12,81,SW,21
1,NaN,NaN,NaN,NaN,NaN,Arnhem,13,12,82,S,6
2,NaN,NaN,NaN,NaN,NaN,Utrecht,5,13,78,S,18
3,NaN,NaN,NaN,NaN,NaN,Rotterdam,0,13,84,SW,13
4,NaN,NaN,NaN,NaN,NaN,Leiden,0,12,89,SW,19
5,NaN,NaN,NaN,NaN,NaN,Den Haag,1,12,85,SW,19
6,NaN,NaN,NaN,NaN,NaN,Rotterdam,0,13,84,SW,16

In [22]:
outer_join = pd.merge(left_df,right_df,left_on='Capital',right_on='Town',how='outer')
outer_join

,Capital,Country,Population,Time_zone,Elevation_x,Town,Elevation_y,Temperature,Humidity,Wind dir,Wind strengh
0,Amsterdam,The Netherland,2480394.0,UTC+1,-2.0,Amsterdam,2.0,12.0,81.0,SW,21.0
1,Rome,Italy,1459402.0,UTC+1,21.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Paris,France,10858852.0,UTC+1,131.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Madrid,Spain,6791667.0,UTC+1,650.0,NaN,NaN,NaN,NaN,NaN,NaN
4,Berlin,Germany,4473101.0,UTC+1,34.0,NaN,NaN,NaN,NaN,NaN,NaN
5,Lisbon,Portugal,2719000.0,UTC+1,2.0,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,Arnhem,13.0,12.0,82.0,S,6.0
7,NaN,NaN,NaN,NaN,NaN,Utrecht,5.0,13.0,78.0,S,18.0
8,NaN,NaN,NaN,NaN,NaN,Rotterdam,0.0,13.0,84.0,SW,13.0
9,NaN,NaN,NaN,NaN,NaN,Rotterdam,0.0,13.0,84.0,SW,16.0
10,NaN,NaN,NaN,NaN,NaN,Leiden,0.0,12.0,89.0,SW,19.0
11,NaN,NaN,NaN,NaN,NaN,Den Haag,1.0,12.0,85.0,SW,19.0

To resume:
- An inner join selects rows that are in common to both left and right selected columns (intersection);
- A left join selects rows that are in common to both left and right selected columns **AND** all the rows of the left DataFrame;
- A right join selects rows that are in common to both left and right selected columns **AND** all the rows of the right DataFrame; 
- An outer join merges the two DataFrames.

To better understand how join works, it may be useful to look at the diagrams below:
<div>
<img src="pictures/joins.jpeg" width="600"/>
</div>
<ul>
    <li> Do you want to select only <strong>common</strong> information between the two DataFrames? Then you would probably need an inner join; </li>
<li> Do you want to add information to your <strong>left</strong> DataFrame? Then you would probably need a left join; </li>
<li> Do you want to add information to your <strong>right</strong> DataFrame? Then you would probably need a right join; </li>
<li> Do you want to get <strong>all</strong> the information from the two DataFrames? Then you would probably need an outer join. </li>
</ul>